app/controllers/api/tracks_controller.rb

  def create
    @track = Track.new(track_params)
    @track.name = @track.name.titleize
    if @track.save
---
INSERT INTO "tracks" ("name", "roll", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"